performance-tests/src/test/resources/request-bodies/send-medical-certificate.xml

<!--
  ~ Copyright (C) 2016 Inera AB (http://www.inera.se)
  ~
  ~ This file is part of sklintyg (https://github.com/sklintyg).
  ~
  ~ sklintyg is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ sklintyg is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:insuranceprocess:healthreporting:SendMedicalCertificateResponder:1" xmlns:urn1="urn:riv:insuranceprocess:healthreporting:medcertqa:1" xmlns:urn2="urn:riv:insuranceprocess:healthreporting:2">
   <soapenv:Header>
      <add:To>FK</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:SendMedicalCertificateRequest>
         <urn:send>
            <urn:vardReferens-id>vårdreferensId</urn:vardReferens-id>
            <urn:avsantTidpunkt>${signeringsDatum}</urn:avsantTidpunkt>
            <urn:adressVard>
               <urn1:hosPersonal>
                  <urn2:personal-id root="1.2.752.129.2.1.4.1" extension="${vardPersonId}"/>
                  <urn2:fullstandigtNamn>${vardPersonNamn}</urn2:fullstandigtNamn>
                  <urn2:forskrivarkod>12345</urn2:forskrivarkod>
                  <urn2:enhet>
                     <urn2:enhets-id root="1.2.752.129.2.1.4.1" extension="{$enhetsId}"/>
                     <urn2:arbetsplatskod root="1.2.752.29.4.71" extension="123456789011"/>
                     <urn2:enhetsnamn>${enhetsNamn}</urn2:enhetsnamn>
                     <urn2:postadress>TEST</urn2:postadress>
                     <urn2:postnummer>12345</urn2:postnummer>
                     <urn2:postort>TEST</urn2:postort>
                     <urn2:telefonnummer>12345</urn2:telefonnummer>
                     <urn2:epost>test@test.com</urn2:epost>
                     <urn2:vardgivare>
                        <urn2:vardgivare-id root="1.2.752.129.2.1.4.1" extension="${vardgivarId}"/>
                        <urn2:vardgivarnamn>${vardgivarNamn}</urn2:vardgivarnamn>
                     </urn2:vardgivare>
                  </urn2:enhet>
               </urn1:hosPersonal>
            </urn:adressVard>
            <urn:lakarutlatande>
               <urn1:lakarutlatande-id>${intygsId}</urn1:lakarutlatande-id>
               <urn1:signeringsTidpunkt>${signeringsDatum}</urn1:signeringsTidpunkt>
               <urn1:patient>
                  <urn2:person-id root="1.2.752.129.2.1.3.1" extension="${personNr}"/>
                  <urn2:fullstandigtNamn>${namn}</urn2:fullstandigtNamn>
               </urn1:patient>
            </urn:lakarutlatande>
         </urn:send>
      </urn:SendMedicalCertificateRequest>
   </soapenv:Body>
</soapenv:Envelope>
